---
kind: property
id: P:Autodesk.Revit.DB.Visual.BumpMap.TextureWAngle
source: html/7d939303-976f-7d0a-0146-7de490724dcf.htm
---
# Autodesk.Revit.DB.Visual.BumpMap.TextureWAngle Property

The property labeled "Angle" from the "BumpMap" schema.

## Syntax (C#)
```csharp
public static string TextureWAngle { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 360".